{
  "backend/main.mo": "Empty Motoko actor with no functionality; backend has no data storage as all content is static.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including hero section updates, mission section, course structure breakdown, application process, and management team page with high confidence mappings to source files.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing routing, pages, components, styling with rose-gold bridal theme, and new management/admin features.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes using neutral grayscale palette for background, foreground, and UI elements.",
  "frontend/index.html": "HTML entry point with meta description highlighting 6 months free beautician course with ISO certification across Tamil Nadu.",
  "frontend/src/App.tsx": "TanStack Router configuration defining routes for Home, Terms, Privacy, Refund, Accessibility, Contact, ManagementTeam, and Admin pages wrapped in Layout component.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, quick links, legal links, contact details (phone 9384459938), social media icons, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing Navigation header and Footer around page content via TanStack Router Outlet.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with logo, menu links (including Management Team), mobile sheet menu, smooth scroll to sections, and WhatsApp/phone call-to-action button.",
  "frontend/src/hooks/useActor.ts": "React hook managing Internet Identity authentication and creating backend actor instances with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend data storage functionality; all content is static and rendered directly in components.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom rose gold and bridal elegance color system using OKLCH color space, including light/dark theme variables and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AccessibilityStatement.tsx": "Static page displaying Nila Bridal Academy's accessibility commitment, efforts, and contact information for assistance requests.",
  "frontend/src/pages/Admin.tsx": "PIN-protected admin dashboard (PIN: 'NILA') with tabs for managing students, courses, certificates, and settings; displays placeholder content after authentication.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying phone number (9384459938), WhatsApp link, service area (Tamil Nadu), and booking information with call-to-action buttons.",
  "frontend/src/pages/Home.tsx": "Main landing page showcasing Nila Bridal Academy's free 6-month beautician course, bridal makeup services, course structure, enrollment steps, and testimonials with hero section and multiple content cards.",
  "frontend/src/pages/ManagementTeam.tsx": "Displays the leadership team page with four team member cards (Founder, Academic Head, Senior Trainer, Student Coordinator) showing profile images, titles, and descriptions, plus contact information.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Renders the privacy policy page explaining data collection, usage for appointment/registration management, and commitment to not sharing information with third parties.",
  "frontend/src/pages/RefundPolicy.tsx": "Shows refund policy page clarifying that training programs are free, bridal makeup advance payments are non-refundable, and rescheduling is allowed based on availability.",
  "frontend/src/pages/TermsConditions.tsx": "Displays terms and conditions page listing service terms including free 6-month course, ISO certification requirements, attendance rules, booking policies, and completion requirements.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with rose-gold theme, OKLCH color system, custom fonts (Inter, Playfair Display), border radius variables, and animation keyframes for accordions.",
  "project_state.json": "Project state file documenting the Nila Bridal Academy website architecture, features, image requirements, and technical notes including free 6-month ISO-certified course, bridal services, and PIN-protected admin panel."
}